// Най-простият начин за проверка на непразен низ
if (typeof someVariable === "string" && someVariable.length > 0)

/*
Тук проверяваме, че имаме работа с низ и че дължината на този низ е по-голяма от 0. Не можем веднага да проверим дължината на низа, тъй като не сме сигурни дали променливата е низ и притежава свойството length, което може да доведе до грешка.

В JavaScript низовете могат да бъдат както обекти String, така и литерали от тип string. Поради това е необходима по-сложна проверка, за да се уверим, че променливата не е равна на null.
*/

if (((typeof someVariable != 'undefined' && someVariable) && someVariable.length() > 0) && typeof someVariable.valueOf() == 'string') ...
